           IDENTIFICATION DIVISION.
           PROGRAM-ID. PROGCOB01.
      *********************************
      ****** AREA DE COMENTARIOS
      *****AUTOR = HUGO VIEIRA  HUGOVIE
      *****OBJETIVO = MOSTRAR A STRING HELLO WORD
      *    DATA 26/12/2019
      ************************************
           ENVIRONMENT DIVISION.
           DATA DIVISION.
           PROCEDURE DIVISION.
               DISPLAY 'HELLO WORD'.
               STOP RUN.
